*  ATTR=YES でプログラムが属性を書く。DSCA で警報を鳴らす。
ATTFMT   FMT
         DEV   TYPE=3270-A2,FEAT=IGNORE,DSCA=X'0090'
         DIV   TYPE=INOUT
         DPAGE CURSOR=((24,2))
         DFLD  'STATE:',POS=(2,2),ATTR=(ALPHA,PROT)
STATEF   DFLD  POS=(2,10),LTH=8,ATTR=(ALPHA,NOPROT)
TRANF    DFLD  POS=(24,2),LTH=12
         FMTEND
ATTIN    MSG   TYPE=INPUT,SOR=(ATTFMT,IGNORE),NXT=ATTOUT
         SEG
         MFLD  (TRANF,'ATT         '),LTH=12
         MFLD  STATEF,LTH=8
         MSGEND
ATTOUT   MSG   TYPE=OUTPUT,SOR=(ATTFMT,IGNORE),NXT=ATTIN
         SEG
         MFLD  STATEF,LTH=8,ATTR=YES
         MSGEND
