*  会話型トランザクション。SPA に前回の値を残す。
CNVFMT   FMT
         DEV   TYPE=3270-A2,FEAT=IGNORE
         DIV   TYPE=INOUT
         DPAGE CURSOR=((4,12))
         DFLD  'ITEM:',POS=(4,2),ATTR=(ALPHA,PROT)
ITEMIN   DFLD  POS=(4,12),LTH=6,ATTR=(NUM,NOPROT,HI)
         DFLD  'PREVIOUS:',POS=(6,2),ATTR=(ALPHA,PROT)
PREVOUT  DFLD  POS=(6,12),LTH=20,ATTR=(ALPHA,PROT)
TRANF    DFLD  POS=(24,2),LTH=12
         FMTEND
CNVIN    MSG   TYPE=INPUT,SOR=(CNVFMT,IGNORE),NXT=CNVOUT
         SEG
         MFLD  (TRANF,'CONV        '),LTH=12
         MFLD  ITEMIN,LTH=6,JUST=R,FILL=C'0'
         MSGEND
CNVOUT   MSG   TYPE=OUTPUT,SOR=(CNVFMT,IGNORE),NXT=CNVIN
         SEG
         MFLD  PREVOUT,LTH=20
         MSGEND
