/* 在庫照会。受け取った品番をそのまま返す（データベースは使わない）。 */
invq: proc(io_ptr) options(main);
  dcl plitdli entry;
  dcl io_ptr pointer;
  dcl 1 io_pcb based(io_ptr),
        2 lterm_name char(8),
        2 reserved1  char(2),
        2 stat_code  char(2),
        2 msg_date   fixed dec(7,0),
        2 msg_time   fixed dec(7,1),
        2 msg_seq    fixed bin(31),
        2 mod_name   char(8),
        2 user_id    char(8);
  dcl 1 msg_in,
        2 in_ll   fixed bin(15),
        2 in_zz   fixed bin(15),
        2 in_tran char(12),
        2 in_item char(6);
  dcl 1 msg_out,
        2 out_ll   fixed bin(15),
        2 out_zz   fixed bin(15),
        2 out_name char(20),
        2 out_date char(8),
        2 out_note char(40);
  dcl three fixed bin(31) init(3);
  dcl four  fixed bin(31) init(4);
  dcl func_gu   char(4) init('GU  ');
  dcl func_isrt char(4) init('ISRT');
  dcl modname   char(8) init('INVOUT  ');

  call plitdli(three, func_gu, io_pcb, msg_in);
  do while (io_pcb.stat_code = '  ');
    msg_out.out_name = 'BOLT ' || msg_in.in_item;
    msg_out.out_date = ' ';                   /* 日付は MFS が入れる */
    msg_out.out_note = 'FOUND 1 ITEM';
    msg_out.out_ll = 72;
    msg_out.out_zz = 0;
    call plitdli(four, func_isrt, io_pcb, msg_out, modname);
    call plitdli(three, func_gu, io_pcb, msg_in);
  end;
  put skip list('seq=', io_pcb.msg_seq, 'stat=', io_pcb.stat_code);
end invq;
