         PCB  TYPE=DB,DBDNAME=STUDENT,PROCOPT=A,KEYLEN=9
         SENSEG NAME=STUDENT,PARENT=0
         SENSEG NAME=COURSE,PARENT=STUDENT
         PSBGEN LANG=PLI,PSBNAME=STUPSB
         END
