*  在庫照会。品番を打ち込むと IMS/DB から品名を引いて返す。
INVFMT   FMT
         DEV   TYPE=3270-A2,FEAT=IGNORE,PFK=(PFKEY,3='/FOR INVOUT.')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((5,20))
         DFLD  'INVENTORY INQUIRY',POS=(1,30),ATTR=(ALPHA,PROT,HI)
         DFLD  'ITEM NO:',POS=(5,10),ATTR=(ALPHA,PROT)
ITEMIN   DFLD  POS=(5,20),LTH=6,ATTR=(NUM,NOPROT,HI)
         DFLD  'NAME:',POS=(7,10),ATTR=(ALPHA,PROT)
NAMEOUT  DFLD  POS=(7,20),LTH=20,ATTR=(ALPHA,PROT)
SYSDATE  DFLD  POS=(1,2),LTH=8,ATTR=(ALPHA,PROT)
MSGOUT   DFLD  POS=(23,2),LTH=40,ATTR=(ALPHA,PROT,HI)
PFKEY    DFLD  POS=(24,2),LTH=12
         FMTEND
INVIN    MSG   TYPE=INPUT,SOR=(INVFMT,IGNORE),NXT=INVOUT
         SEG
         MFLD  (PFKEY,'INVQ        '),LTH=12
         MFLD  ITEMIN,LTH=6,JUST=R,FILL=C'0'
         MSGEND
INVOUT   MSG   TYPE=OUTPUT,SOR=(INVFMT,IGNORE),NXT=INVIN
         SEG
         MFLD  NAMEOUT,LTH=20
         MFLD  (SYSDATE,DATE2)
         MFLD  MSGOUT,LTH=40
         MSGEND
