         PCB  TYPE=TP
         PCB  TYPE=DB,DBDNAME=ITEM,PROCOPT=A,KEYLEN=6
         SENSEG NAME=ITEM,PARENT=0
         PSBGEN LANG=PLI,PSBNAME=INVPSB
         END
