         DBD  NAME=ITEM,ACCESS=HDAM
         SEGM NAME=ITEM,PARENT=0,BYTES=26
         FIELD NAME=(ITEMNO,SEQ,U),BYTES=6,START=1,TYPE=C
         FIELD NAME=ITEMNAME,BYTES=20,START=7,TYPE=C
         DBDGEN
         FINISH
         END
